---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption.Flat
enum: Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption
source: html/aee63133-70ad-7902-c3b5-1f162151679b.htm
---
# Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption.Flat

The slope of the sketched run/landing will be kept flat.